#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** Braindump Frank
:LOGBOOK:
CLOCK: [2023-12-11 Mon 14:38]--[2023-12-11 Mon 15:32] =>  0:54
CLOCK: [2023-12-11 Mon 13:20]--[2023-12-11 Mon 14:34] =>  1:14
:END:
- [X] Write everything down which crosses my head
  - [X] [#A] Video
  - [X] [#B] Video should be fun
  - [X] [#C] its a block explorer
  - [X] [#C] it uses ar to visualize things
  - [X] [#C] unified function which are tru for every chain
  - [X] [#C] We have ui
  - [X] [#C] the ui uses bootstrap
  - [X] [#B] a design sheet would be sweet
  - [X] [#B] we have a docs
  - [X] [#C] we have most likely no smart contract
  - [X] [#C] neither a backend i assume
  - [X] [#C] we have multiple QR Code
  - [X] [#A] we wann have a cool cube
  - [X] [#C] i like wood
  - [X] [#A] I have to look for a fab lap
  - [X] [#B] produce niklaous thingies
  - [X] [#B] get addreses of particpatnts and send it to them
  - [X] [#A] We need a presentation
  - [X] [#C] We need a team section
  - [X] [#C] We are using react
  - [X] [#C] we are using ar.js
  - [X] [#B] a rough taks table would be cool
  - [X] [#C] maybe integrate a product service
  - [X] [#C] search for a product service
  - [X] [#A] We need 3D Models
  - [X] [#C] I would love to make one
  - [X] [#C] Or 6 via Blender
  - [X] [#C] so there could be a 3D Folder
  - [X] [#C] We need kind of structure of our documentation
  - [X] [#C] A software Design sheet can be kind of useful
  - [X] [#A] I assume buisness is important
  - [X] [#A] write people annoy them as hell
  - [X] [#A] We need a nice readme.md
  - [X] [#A a beautiful thumb mail
  - [X] [#C] ok now to the dev side
  - [X] [#C] we have frontend
  - [X] [#C] the frontend has multiple image recongizing
  - [X] [#A] We wanna a selction filed which allows you to custome your cubo
  - [X] [#C] A more simple example is to show one model on each cube
  - [X] [#C] Bassed on the selected networks model chagnes size
  - [X] [#C] Model changes color
  - [X] [#C] model changes shading
  - [X] [#C] Or depends on number diffent effect get added
  - [X] [#A] the canvas buisness model should be full fledged out
  - [X] [#C] On e page of canvas buisness model
  - [X] [#C] every section has 1 paragraph of explantion
  - [X] [#C] So we have two pages
  - [X] [#A] Page one Visualize
  - [X] [#A] Page two Configuration
  - [X] [#A] Build a nice Weclome Page
  - [X] [#C] the Page has a button called enter app
  - [X] [#C] I should also take look at next avlidator setups
  - [X] [#C] stake my dots somehwere
  - [X] [#C] I should make a vitepress site for unifire
  - [X] [#B] I wanna go to the bath
  - [X] I should write vik and gabo and six
  - [X] [#C] Going to christmas market
  - [X] [#A] on satruday is concert
  - [X] [#C] extend hostel or switch to aribnbn
  - [X] [#B] call with josiah
  - [X] [#C] buy thingies for headset
  - [X] [#C] microphone
  - [X] [#C] cable
  - [X] [#C] oh gosh yeah the cable
  - [X] [#C] maybe look for present, but most likely i will not docs- [ ] 22 is bauwagen thingy
  - [X] [#C] book a flight
  - [X] [#A] ok thats a lot. lets structure it.
** Braindum (Structure Version)
:LOGBOOK:
CLOCK: [2023-12-11 Mon 16:01]--[2023-12-11 Mon 16:19] =>  0:18
CLOCK: [2023-12-11 Mon 15:43]--[2023-12-11 Mon 16:01] =>  0:18
:END:
- [X] Important Thingies
  - [X] Fabrication
    - [X] [#A] we wann have a cool cube
    - [X] [#A] I have to look for a fab lap
  - [X] Presentation
    - [X] [#A] Video
    - [X] [#A] We need a presentation
    - [X] [#A] I assume buisness is important
    - [X] [#A] write people annoy them as hell
    - [X] [#A] We need a nice readme.md
    - [X] [#A a beautiful thumb mail
    - [X] [#A] the canvas buisness model should be full fledged out
  - [X] Developing & Design
    - [X] [#A] We wanna a selction filed which allows you to custome your cubo
    - [X] [#A] Page one Visualize
    - [X] [#A] Page two Configuration
    - [X] [#A] Build a nice Weclome Page
  - [X] Real Life
    - [X] [#A] on satruday is concert

** Rephrase it
- [X] Real Life
  - [X] go to hot tub in budapest
  - [X] go to concert
  - [X] go to christmas market
- [X] Fabrication
  - [X] Get draft from Botond
  - [X] Go to FabLab Budapest
  - [X] Redesign Cube for Production
  - [X] Fabricte Cube
- [X] Presenation
  - [X] Make a presenation
    - [X] init in docs presenation
    - [X] add slidev
    - [X] Add necessary slide
  - [X] Make a 3 Minutes Video
    - [X] Intro 15s
    - [X] Problem / Solution 30s
    - [X] Technologies 30s
    - [X] Demo - 1,5min
    - [X] Code References - 15s
    - [X] Outro - 15s
- [X] Developing & Design
  - [X] Setup Figma
    - [X] Import Bootstrap components
    - [X] Make a landing page
  - [X] Developing
    - [X] Write landing page in jsx
    - [X] send it to Botond
  - [X] Back to Figma, iterate

** TODO [#A] Developing and Design
:LOGBOOK:
CLOCK: [2023-12-12 Tue 11:03]--[2023-12-12 Tue 12:19] =>  1:16
CLOCK: [2023-12-12 Tue 10:03]--[2023-12-12 Tue 10:49] =>  0:46
CLOCK: [2023-12-11 Mon 16:38]--[2023-12-11 Mon 17:43] =>  1:05
CLOCK: [2023-12-11 Mon 16:18]--[2023-12-11 Mon 16:26] =>  0:08
:END:
- [-] Developing & Design [3/9]
  - [X] Play around with bootstrap landing page thingies
  - [X] create playground/grayscale (simplistic bt theme)
  - [ ] create Logo
  - [ ] create a Tagline
  - [ ] create 3 features
  - [ ] Setup Figma
    - [ ] Import Bootstrap components
    - [ ] Make a landing page
  - [ ] Developing
    - [ ] Write landing page in jsx
    - [ ] send it to Botond
  - [ ] Back to Figma, iterate
  - [X] Explore Visual Copilot
    - [X] watch video
    - [X] Create new figmal file
    - [X] Create a Welcome page
    - [X] create typography
      - [X] it contains h1
      - [X] it contains h2
      - [X] it contains h3
      - [X] it contains p
    - [X] instal Vistual studio copilot
    - [X] add in playgroun VisualCopilot
    - [X] create welcome.html
    - [ ] code typography.html
